content/public_lists/dem_comments.md
+++
title = "Dem Comments"
author = ["Hrishikesh Barman"]
draft = false
+++

collection of comments across different forums on the internet inspired by [HN: the good parts](https://danluu.com/hn-comments/). As you can see, currently it's empty.


## Reddit {#reddit}

-   I'm a senior [dev](https://www.reddit.com/r/softwaredevelopment/comments/gy6bbp/how_to_approach_software_development_like_a/) and have accepted that senior doesn't mean all knowing. It means knowing when it's time to RTFM, how to handle complex problems, debugging weird shit and being able to plan and lead the application development and deployment.


## HN {#hn}

-   A data structure can be seen as an interface, a logical structure, a physical layout, or an encoding. When you teach them, you have to start from somewhere.
